junit_web_service_testing/war/src/test/resources/fullSOAPMessage.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:DoubleIt xmlns:ns2="http://www.example.org/schema/DoubleIt">
         <numberToDouble>0</numberToDouble>
      </ns2:DoubleIt>
   </soap:Body>
</soap:Envelope>

