src/test/manual/service-request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <DoubleIt xmlns="http://www.example.org/schema/DoubleIt">
            <numberToDouble xmlns="">42</numberToDouble>
        </DoubleIt>
    </Body>
</Envelope>
